<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"35440df621ce49d5b6bf262883482b43edf2e2c0dca040c2bb9429b7425c58ff","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1723 at https://github.com/cal-itp/data-infra/actions/runs/23823506933","plan_out_hash":"0c0c132069083c211713e375de6cc4f586821c1fe7e70d9ae1134960becf5e65","plan_hash":"c45402ba0c4a30bd7d797c75cdf25e8fd9ec87674f4ecac8a8f8d3de6ab8618b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["dbt_project.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "B4kZuA==" -> (known after apply)
!~      detect_md5hash      = "QRHyoy6J9qWBj1aGwl6z5A==" -> "different hash"
!~      generation          = 1773238443241252 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/dbt_project.yml"
!~      md5hash             = "QRHyoy6J9qWBj1aGwl6z5A==" -> (known after apply)
        name                = "data/warehouse/dbt_project.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "IHcdjA==" -> (known after apply)
!~      detect_md5hash      = "oPPbxAkvYjwC9kA28z2AyQ==" -> "different hash"
!~      generation          = 1754523290751485 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"
!~      md5hash             = "oPPbxAkvYjwC9kA28z2AyQ==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/_mart_gtfs_fcts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "P4eAwA==" -> (known after apply)
!~      detect_md5hash      = "2MPto/410bTo191rzm8sNw==" -> "different hash"
!~      generation          = 1773704940461014 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/_mart_gtfs_fcts.yml"
!~      md5hash             = "2MPto/410bTo191rzm8sNw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/_mart_gtfs_fcts.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1723](https://github.com/cal-itp/data-infra/actions/runs/23823506933)